evaluators/java-oracle/evaluator.yaml
schema_version: "1"
evaluator:
  id: java-oracle
  version: "1"
  revision: source-tree
  target_profile: artemis-java-maven
  implementation_digest: f4a45016480606f138d3c6137078e2a1524395ccd9fea20ccc4128d5a30c3b4e
suite:
  id: java-oracle-development
  version: "1"
  digest: 5fcafe00f8d0214d1b191fecf66d0240da0f4f50e8f229f1b915fa7cb6bef1b7
requested_metrics:
  - build.template_compiles
  - build.solution_compiles
  - tests.executable
  - tests.count
  - oracle.solution_pass_rate
  - oracle.template_pass_rate
  - oracle.satisfied
  - coverage.statement
  - coverage.branch
  - mutation.score
process:
  argv:
    - "{bun}"
    - run
    - worker.ts
    - --config
    - config.maven.yaml
    - --config-digest
    - 97d36caed9561f34afe615f876e603225f1fd001e712f81d5bde395aba458161
  cwd: "."
  env: {}
execution:
  timeout_ms: 1800000
  concurrency: 2
  maximum_input_bytes: 1048576
  maximum_response_bytes: 16777216
  maximum_log_bytes: 1048576
  termination_grace_ms: 10000