evaluators/java-oracle/evaluator.yaml
schema_version: "1"
evaluator:
  id: java-oracle
  version: "1"
  revision: source-tree
  target_profile: artemis-java-maven
  implementation_digest: 3c810f444adc79ff032cf8a77a0fb8d06e57c76de531df45bc52281464758cad
suite:
  id: java-oracle-development
  version: "1"
  digest: 9f68762efb57c06553df1ca251b7346d5ed564d71d48aa9b32f6f69e3a33aaef
requested_metrics:
  - build.template_compiles
  - build.solution_compiles
  - tests.executable
  - tests.count
  - oracle.solution_pass_rate
  - oracle.template_pass_rate
  - oracle.satisfied
  - coverage.statement
  - coverage.branch
  - mutation.score
process:
  argv:
    - "{bun}"
    - run
    - worker.ts
    - --config
    - config.maven.yaml
    - --config-digest
    - 3aea5d2ad5706e2741154dedac5b0344bd0c3149d9a2364f9df550ea80445149
  cwd: "."
  env: {}
execution:
  timeout_ms: 1800000
  concurrency: 2
  maximum_input_bytes: 1048576
  maximum_response_bytes: 16777216
  maximum_log_bytes: 1048576
  termination_grace_ms: 10000