evaluators/java-oracle/evaluator.yaml
# `exgen evaluate process` configuration for the java-oracle evaluator.
#
# Regenerate implementation_digest and suite.digest with:
# bun run evaluators/shared/identity.ts evaluators/java-oracle
# Regenerate the backend digest in argv with:
# bun run worker.ts --config config.maven.yaml --print-config-digest
#
# argv names config.maven.yaml, which builds the candidate: the generated tests repository is the
# Maven project and the submission under test is written into assignment/. It needs a Maven and a
# JDK on the host, and network access on a cold local repository.
#
# To decide the gate inside a deployment instead (decision D1), copy config.localci.example.yaml and
# point argv at it. The digest covers argv, so a new path is a new evaluator identity; editing a
# backend configuration in place would change what is measured without changing the digest.
schema_version: "1"
evaluator:
  id: java-oracle
  version: "1"
  revision: source-tree
  target_profile: artemis-java-maven
  implementation_digest: f5c6631f921205a0a31ce4ac660162633d54eede65a68c2f29dcb6aa5539a873
suite:
  id: java-oracle-development
  version: "1"
  digest: e93b8ba19f1143e38973045ba67c7a2f76abc06367de79c9b1f6ea554881cf9d
requested_metrics:
  - build.template_compiles
  - build.solution_compiles
  - tests.executable
  - tests.count
  - oracle.solution_pass_rate
  - oracle.template_pass_rate
  - oracle.satisfied
  - coverage.statement
  - coverage.branch
  - mutation.score
process:
  argv:
    - "{bun}"
    - run
    - worker.ts
    - --config
    - config.maven.yaml
    - --config-digest
    - 97d36caed9561f34afe615f876e603225f1fd001e712f81d5bde395aba458161
  cwd: "."
  env: {}
execution:
  timeout_ms: 1800000
  concurrency: 2
  maximum_input_bytes: 1048576
  maximum_response_bytes: 16777216
  maximum_log_bytes: 1048576
  termination_grace_ms: 10000